server/app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def all_blogs
    @blogs = Blog.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index_by_user
    @user = User.find(params[:user_id])

INSERT INTO "blogs" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @blog = @current_user.blogs.build(blog_params)

    if @blog.save

UPDATE "blogs" SET "title" = $1, "text" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["title", "Broken Glasssss"], ["text", ""], ["updated_at", "2020-04-14 19:51:37.449107"], ["id", 20]]
---
  def update
    if @blog.update(blog_params)